# RbsCurveVertOffsetParam Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..RbsCurveVertOffsetParam Property
ParameterTypeId Class See Also
---
"Vertical Justification"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId RbsCurveVertOffsetParam { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property RbsCurveVertOffsetParam As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ RbsCurveVertOffsetParam {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace